mixly/Mixly_Arduino/mixly_arduino/arduino/portable/packages/esp32/hardware/esp32/1.0.3/boards.txt
##############################################################


mixgo.name=Arduino MixGo

mixgo.upload.tool=esptool_py
mixgo.upload.maximum_size=1310720
mixgo.upload.maximum_data_size=327680
mixgo.upload.wait_for_upload_port=true

mixgo.serial.disableDTR=true
mixgo.serial.disableRTS=true

mixgo.build.mcu=esp32
mixgo.build.core=esp32
mixgo.build.variant=esp32
mixgo.build.board=ESP32_DEV

mixgo.build.f_cpu=240000000L
mixgo.build.flash_size=4MB
mixgo.build.flash_freq=40m
mixgo.build.flash_mode=dio
mixgo.build.boot=dio
mixgo.build.partitions=huge_app
mixgo.build.defines=

mixgo.menu.PSRAM.disabled=Disabled
mixgo.menu.PSRAM.disabled.build.defines=
mixgo.menu.PSRAM.enabled=Enabled
mixgo.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-issue
mixgo.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
mixgo.menu.PartitionScheme.huge_app.build.partitions=huge_app
mixgo.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
mixgo.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
mixgo.menu.PartitionScheme.default.build.partitions=default
mixgo.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
mixgo.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
mixgo.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
mixgo.menu.PartitionScheme.minimal.build.partitions=minimal
mixgo.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
mixgo.menu.PartitionScheme.no_ota.build.partitions=no_ota
mixgo.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
mixgo.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
mixgo.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
mixgo.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
mixgo.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
mixgo.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
mixgo.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
mixgo.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
mixgo.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
mixgo.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
mixgo.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
mixgo.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
mixgo.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
mixgo.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FAT)
mixgo.menu.PartitionScheme.fatflash.build.partitions=ffat

mixgo.menu.CPUFreq.240=240MHz (WiFi/BT)
mixgo.menu.CPUFreq.240.build.f_cpu=240000000L
mixgo.menu.CPUFreq.160=160MHz (WiFi/BT)
mixgo.menu.CPUFreq.160.build.f_cpu=160000000L
mixgo.menu.CPUFreq.80=80MHz (WiFi/BT)
mixgo.menu.CPUFreq.80.build.f_cpu=80000000L
mixgo.menu.CPUFreq.40=40MHz (40MHz XTAL)
mixgo.menu.CPUFreq.40.build.f_cpu=40000000L
mixgo.menu.CPUFreq.26=26MHz (26MHz XTAL)
mixgo.menu.CPUFreq.26.build.f_cpu=26000000L
mixgo.menu.CPUFreq.20=20MHz (40MHz XTAL)
mixgo.menu.CPUFreq.20.build.f_cpu=20000000L
mixgo.menu.CPUFreq.13=13MHz (26MHz XTAL)
mixgo.menu.CPUFreq.13.build.f_cpu=13000000L
mixgo.menu.CPUFreq.10=10MHz (40MHz XTAL)
mixgo.menu.CPUFreq.10.build.f_cpu=10000000L

mixgo.menu.FlashMode.qio=QIO
mixgo.menu.FlashMode.qio.build.flash_mode=dio
mixgo.menu.FlashMode.qio.build.boot=qio
mixgo.menu.FlashMode.dio=DIO
mixgo.menu.FlashMode.dio.build.flash_mode=dio
mixgo.menu.FlashMode.dio.build.boot=dio
mixgo.menu.FlashMode.qout=QOUT
mixgo.menu.FlashMode.qout.build.flash_mode=dout
mixgo.menu.FlashMode.qout.build.boot=qout
mixgo.menu.FlashMode.dout=DOUT
mixgo.menu.FlashMode.dout.build.flash_mode=dout
mixgo.menu.FlashMode.dout.build.boot=dout

mixgo.menu.FlashFreq.80=80MHz
mixgo.menu.FlashFreq.80.build.flash_freq=80m
mixgo.menu.FlashFreq.40=40MHz
mixgo.menu.FlashFreq.40.build.flash_freq=40m

mixgo.menu.FlashSize.4M=4MB (32Mb)
mixgo.menu.FlashSize.4M.build.flash_size=4MB
mixgo.menu.FlashSize.2M=2MB (16Mb)
mixgo.menu.FlashSize.2M.build.flash_size=2MB
mixgo.menu.FlashSize.2M.build.partitions=minimal
mixgo.menu.FlashSize.16M=16MB (128Mb)
mixgo.menu.FlashSize.16M.build.flash_size=16MB
mixgo.menu.FlashSize.16M.build.partitions=ffat

mixgo.menu.UploadSpeed.921600=921600
mixgo.menu.UploadSpeed.921600.upload.speed=921600
mixgo.menu.UploadSpeed.115200=115200
mixgo.menu.UploadSpeed.115200.upload.speed=115200
mixgo.menu.UploadSpeed.256000.windows=256000
mixgo.menu.UploadSpeed.256000.upload.speed=256000
mixgo.menu.UploadSpeed.230400.windows.upload.speed=256000
mixgo.menu.UploadSpeed.230400=230400
mixgo.menu.UploadSpeed.230400.upload.speed=230400
mixgo.menu.UploadSpeed.460800.linux=460800
mixgo.menu.UploadSpeed.460800.macosx=460800
mixgo.menu.UploadSpeed.460800.upload.speed=460800
mixgo.menu.UploadSpeed.512000.windows=512000
mixgo.menu.UploadSpeed.512000.upload.speed=512000

mixgo.menu.DebugLevel.none=None
mixgo.menu.DebugLevel.none.build.code_debug=0
mixgo.menu.DebugLevel.error=Error
mixgo.menu.DebugLevel.error.build.code_debug=1
mixgo.menu.DebugLevel.warn=Warn
mixgo.menu.DebugLevel.warn.build.code_debug=2
mixgo.menu.DebugLevel.info=Info
mixgo.menu.DebugLevel.info.build.code_debug=3
mixgo.menu.DebugLevel.debug=Debug
mixgo.menu.DebugLevel.debug.build.code_debug=4
mixgo.menu.DebugLevel.verbose=Verbose
mixgo.menu.DebugLevel.verbose.build.code_debug=5

##############################################################
handbit.name=Arduino HandBit

handbit.upload.tool=esptool_py
handbit.upload.maximum_size=1310720
handbit.upload.maximum_data_size=327680
handbit.upload.wait_for_upload_port=true

handbit.serial.disableDTR=true
handbit.serial.disableRTS=true

handbit.build.mcu=esp32
handbit.build.core=esp32
handbit.build.variant=handbit
handbit.build.board=ESP32_DEV

handbit.build.f_cpu=240000000L
handbit.build.flash_size=8MB
handbit.build.flash_freq=40m
handbit.build.flash_mode=dio
handbit.build.boot=dio
handbit.build.partitions=huge_app
handbit.build.defines=

handbit.menu.PSRAM.disabled=Disabled
handbit.menu.PSRAM.disabled.build.defines=
handbit.menu.PSRAM.enabled=Enabled
handbit.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-issue

handbit.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
handbit.menu.PartitionScheme.huge_app.build.partitions=huge_app
handbit.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
handbit.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
handbit.menu.PartitionScheme.default.build.partitions=default
handbit.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
handbit.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
handbit.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
handbit.menu.PartitionScheme.minimal.build.partitions=minimal
handbit.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
handbit.menu.PartitionScheme.no_ota.build.partitions=no_ota
handbit.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
handbit.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
handbit.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
handbit.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
handbit.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
handbit.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
handbit.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
handbit.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
handbit.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
handbit.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
handbit.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
handbit.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
handbit.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
handbit.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FAT)
handbit.menu.PartitionScheme.fatflash.build.partitions=ffat

handbit.menu.CPUFreq.240=240MHz (WiFi/BT)
handbit.menu.CPUFreq.240.build.f_cpu=240000000L
handbit.menu.CPUFreq.160=160MHz (WiFi/BT)
handbit.menu.CPUFreq.160.build.f_cpu=160000000L
handbit.menu.CPUFreq.80=80MHz (WiFi/BT)
handbit.menu.CPUFreq.80.build.f_cpu=80000000L
handbit.menu.CPUFreq.40=40MHz (40MHz XTAL)
handbit.menu.CPUFreq.40.build.f_cpu=40000000L
handbit.menu.CPUFreq.26=26MHz (26MHz XTAL)
handbit.menu.CPUFreq.26.build.f_cpu=26000000L
handbit.menu.CPUFreq.20=20MHz (40MHz XTAL)
handbit.menu.CPUFreq.20.build.f_cpu=20000000L
handbit.menu.CPUFreq.13=13MHz (26MHz XTAL)
handbit.menu.CPUFreq.13.build.f_cpu=13000000L
handbit.menu.CPUFreq.10=10MHz (40MHz XTAL)
handbit.menu.CPUFreq.10.build.f_cpu=10000000L

handbit.menu.FlashMode.qio=QIO
handbit.menu.FlashMode.qio.build.flash_mode=dio
handbit.menu.FlashMode.qio.build.boot=qio
handbit.menu.FlashMode.dio=DIO
handbit.menu.FlashMode.dio.build.flash_mode=dio
handbit.menu.FlashMode.dio.build.boot=dio
handbit.menu.FlashMode.qout=QOUT
handbit.menu.FlashMode.qout.build.flash_mode=dout
handbit.menu.FlashMode.qout.build.boot=qout
handbit.menu.FlashMode.dout=DOUT
handbit.menu.FlashMode.dout.build.flash_mode=dout
handbit.menu.FlashMode.dout.build.boot=dout

handbit.menu.FlashFreq.80=80MHz
handbit.menu.FlashFreq.80.build.flash_freq=80m
handbit.menu.FlashFreq.40=40MHz
handbit.menu.FlashFreq.40.build.flash_freq=40m

handbit.menu.FlashSize.8M=8MB (64Mb)
handbit.menu.FlashSize.8M.build.flash_size=8MB
handbit.menu.FlashSize.4M=4MB (32Mb)
handbit.menu.FlashSize.4M.build.flash_size=4MB
handbit.menu.FlashSize.2M=2MB (16Mb)
handbit.menu.FlashSize.2M.build.flash_size=2MB
handbit.menu.FlashSize.2M.build.partitions=minimal
handbit.menu.FlashSize.16M=16MB (128Mb)
handbit.menu.FlashSize.16M.build.flash_size=16MB
handbit.menu.FlashSize.16M.build.partitions=ffat

handbit.menu.UploadSpeed.921600=921600
handbit.menu.UploadSpeed.921600.upload.speed=921600
handbit.menu.UploadSpeed.115200=115200
handbit.menu.UploadSpeed.115200.upload.speed=115200
handbit.menu.UploadSpeed.256000.windows=256000
handbit.menu.UploadSpeed.256000.upload.speed=256000
handbit.menu.UploadSpeed.230400.windows.upload.speed=256000
handbit.menu.UploadSpeed.230400=230400
handbit.menu.UploadSpeed.230400.upload.speed=230400
handbit.menu.UploadSpeed.460800.linux=460800
handbit.menu.UploadSpeed.460800.macosx=460800
handbit.menu.UploadSpeed.460800.upload.speed=460800
handbit.menu.UploadSpeed.512000.windows=512000
handbit.menu.UploadSpeed.512000.upload.speed=512000

handbit.menu.DebugLevel.none=None
handbit.menu.DebugLevel.none.build.code_debug=0
handbit.menu.DebugLevel.error=Error
handbit.menu.DebugLevel.error.build.code_debug=1
handbit.menu.DebugLevel.warn=Warn
handbit.menu.DebugLevel.warn.build.code_debug=2
handbit.menu.DebugLevel.info=Info
handbit.menu.DebugLevel.info.build.code_debug=3
handbit.menu.DebugLevel.debug=Debug
handbit.menu.DebugLevel.debug.build.code_debug=4
handbit.menu.DebugLevel.verbose=Verbose
handbit.menu.DebugLevel.verbose.build.code_debug=5


